<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"b6393c74460c13017e883df9f410a212d12828310622183531ffa1894f93287b","plan_job_ref":"Job Validations on PR #77 at https://github.com/SelfOverflow/discord-bots/actions/runs/22917454523","plan_out_hash":"362823090f54fb797baff78ace2d2a11267bbbf350b83cbc00323332cede6b93","plan_hash":"54093fb0d68f58d939930e24d55916ed6960156abcf21cfbd672f54582cbf74a","plan_text_format":"diff","version":"2.0.0","closed":true} -->
Terraform plan in __./apps/bablu/terraform__
With variables: `image_tag = "bd043b2dc755c20f1966df43c23edbc83d934bb1"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_ecr_repository.bablu-bot-ecr will be created
+   resource "aws_ecr_repository" "bablu-bot-ecr" {
+       arn                  = (known after apply)
+       force_delete         = true
+       id                   = (known after apply)
+       image_tag_mutability = "MUTABLE"
+       name                 = "bablu-bot-container-repository"
+       registry_id          = (known after apply)
+       repository_url       = (known after apply)
+       tags_all             = (known after apply)

+       image_scanning_configuration {
+           scan_on_push = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Post merge deploy to production #52](https://github.com/SelfOverflow/discord-bots/actions/runs/22917633241)